     A*%%TS  SD  20260727  175315  RAIPX6      REL-V7R5M0  5770-WDS
     A*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     A* Display File : STATELIST
     A* Purpose      : Windowed subfile - lists states for a given country.
     A*                Supports PgUp / PgDn scrolling.
     A* Compile      : CRTDSPF FILE(RAIPX61/STATELIST)
     A*                        SRCFILE(RAIPX61/QDDSSRC) SRCMBR(STATELIST)
     A*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      INDARA
     A                                      CA03(03 'F3=Exit')
     A                                      CA12(12 'F12=Cancel')
     A*
     A*-------------------------------------------------------------------------
     A* Record: SFLRCD  - Subfile record (one state per line)
     A*-------------------------------------------------------------------------
     A          R SFLRCD                    SFL
     A*%%TS  SD  20260727  175315  RAIPX6      REL-V7R5M0  5770-WDS
     A            SFLRRN         4S 0H
     A            STATENAME     40A  O  6  5
     A*
     A*-------------------------------------------------------------------------
     A* Record: SFLCTL  - Subfile control record (windowed)
     A*-------------------------------------------------------------------------
     A          R SFLCTL                    SFLCTL(SFLRCD)
     A*%%TS  SD  20260727  175315  RAIPX6      REL-V7R5M0  5770-WDS
     A                                      OVERLAY
     A  31                                  SFLDSP
     A  32                                  SFLDSPCTL
     A  33                                  SFLCLR
     A  34                                  SFLEND(*MORE)
     A                                      SFLSIZ(0200)
     A                                      SFLPAG(0008)
     A                                      WINDOW(4 5 18 60)
     A                                      WDWBORDER((*COLOR YLW) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A            SFLRCDNBR      4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  5'IBM I - STATES VIEWER'
     A                                      DSPATR(HI)
     A                                  2  5'Country :'
     A            CTRYNAME      30A  O  2 16DSPATR(HI)
     A                                  3  5'-----------------------------------
     A                                      -----------'
     A                                  4  5'  #   State / Region'
     A                                  5  5'-----------------------------------
     A                                      -----------'
     A
     A*                                16  5'-----------------------------------
     A*                                     -----------'
     A*                                15  5'F3=Exit  F12=Cancel  +/-=Scroll'
     A*                                     COLOR(BLU)
     A
     A*-------------------------------------------------------------------------
     A* Record: MSGCTL  - Bottom message bar (error / info)
     A*-------------------------------------------------------------------------
     A          R MSGCTL
     A                                      OVERLAY
     A            MSGLINE       79A  O 24  1COLOR(RED)
     A*
     A*-------------------------------------------------------------------------
     A* Record: PROMPTRCD - Input screen for country name
     A*-------------------------------------------------------------------------
     A          R PROMPTRCD
     A                                  1  2'IBM i First Project - State Li+
     A                                      ster'
     A                                      DSPATR(HI)
     A                                  3  2'Enter country name and press E+
     A                                      nter:'
     A            CTRYINPUT     30A  B  3 38CHECK(LC)
     A                                      DSPATR(UL)
     A                                 22  2'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23  2'---------------------------------+
     A                                      -----------------------------------'
     A            ERRMSG        79A  O 24  1COLOR(RED)
